Nicolas7474/STM32_ESP32_OTA_UART_Dual-Bank_Bootloader/STM32/common/src/uart3.cpp
/* STM32F469
******* UART3 - C++ Bare-Metal Driver - Polling, Interrupts and DMA based  **
******* with COBS option
******** See usage example for IT and DMA in main.c  ****************/

#include "../inc/uart3.hpp"   // Always include its own header first

#include "timers.h"  // For GetSysTick() timing guards
// C++ Library implementations used inside the driver logic
#include <cstring>    // For std::memcpy
#include <algorithm>  // For std::min

// ============================================================================
// COMPILE-TIME MCU BUS CLOCK LOOKUP
// ============================================================================
// Detects standard STM32 macro targets and configures peripheral clock speeds
#if defined(STM32F469xx) || defined(STM32F479xx) || defined(STM32F429xx) || defined(STM32F439xx)
    #define APB1_CLOCK_FREQ   45000000U  // 45 MHz
    #define APB2_CLOCK_FREQ   90000000U  // 90 MHz

#elif defined(STM32F407xx) || defined(STM32F417xx) || defined(STM32F405xx) || defined(STM32F415xx)
    #define APB1_CLOCK_FREQ   42000000U  // 42 MHz
    #define APB2_CLOCK_FREQ   84000000U  // 84 MHz

#elif defined(STM32F411xE)
    #define APB1_CLOCK_FREQ   50000000U  // 50 MHz
    #define APB2_CLOCK_FREQ   100000000U // 100 MHz

#elif defined(STM32F401xC) || defined(STM32F401xE)
    #define APB1_CLOCK_FREQ   42000000U  // 42 MHz
    #define APB2_CLOCK_FREQ   84000000U  // 84 MHz

#else
    // Default Fallback configuration (e.g., Standard STM32F469 180MHz tree defaults)
    #define APB1_CLOCK_FREQ   45000000U
    #define APB2_CLOCK_FREQ   90000000U
#endif


//#define USE_COBS
#if defined(USE_COBS)
#include "cobs.h"
uint8_t encodeBuffer[2] = {0}; // COBS
#endif

// Default weak definitions so the linker doesn't complain if they are missing. We aren't using extern "C" to write C code.
// We are using it to turn off C++ name mangling so that the linker can successfully match and override your weak fallback function.
extern "C" {
    __attribute__((weak)) void UART_RxCpltCallback_DMA(const UartDriver& instance, std::span<const uint8_t> incoming_data) {
        (void)instance;
        (void)incoming_data; // Default: do nothing
    }

    __attribute__((weak)) void UART_RxCpltCallback_IT(const UartDriver& instance, std::span<const uint8_t> incoming_data) {
        (void)instance;
        (void)incoming_data; // Default: do nothing
    }
}

// ============================================================================
// HARDWARE ISOLATION LAYER
// ============================================================================

// Handles the strict, unchangeable hardware connections for UART3, acts as a pin guard so that other instances cannot steal these pins
static void USART3_LowLevelInit(void) {
    // Enable peripheral clocks (USART3 is on APB1, GPIOB and DMA1 are on AHB1)
    RCC->APB1ENR |= RCC_APB1ENR_USART3EN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;

    // 1. CLAMP BOTH LINES HIGH: Set Pull-up (0b01) on PB10 (TX) and PB11 (RX)
    // Prevents PB10 from sagging low during mode transition
    GPIOB->PUPDR &= ~((3U << 20) | (3U << 22)); // Clear bits for Pin 10 & 11
    GPIOB->PUPDR |=  ((1U << 20) | (1U << 22)); // Set Pull-up (01)

    // 2. MAP MUX FIRST: Route Pin 10 and Pin 11 to AF7 (USART3)
    // AFR[1] handles pins 8-15. Pin 10 is index 2, Pin 11 is index 3.
    GPIOB->AFR[1] &= ~((15U << 8) | (15U << 12)); // Clear 4-bit fields
    GPIOB->AFR[1] |=  ((7U  << 8) | (7U  << 12)); // Set AF7 (0111)

    // 3. ENGAGE PINS: Safely switch to Alternate Function Mode (0b10)
    GPIOB->MODER &= ~((3U << 20) | (3U << 22));
    GPIOB->MODER |=  ((2U << 20) | (2U << 22));

    // 4. SPEED: Configure High Speed (0b10) or Very High Speed (0b11)
    // Matching your original choice of '3' (Very High Speed)
    GPIOB->OSPEEDR &= ~((3U << 20) | (3U << 22));
    GPIOB->OSPEEDR |=  ((3U << 20) | (3U << 22));
}

// Handles the strict, unchangeable hardware connections for UART6, acts as a pin guard so that other instances cannot steal these pins
static void USART6_LowLevelInit(void) {
    // Enable peripheral clocks
    RCC->APB2ENR |= RCC_APB2ENR_USART6EN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

    // 1. CLAMP BOTH LINES HIGH: Set Pull-up (0b01) on PC6 (TX) and PC7 (RX)
    // This stops PC6 from sagging low (Tx frame error) at init !
    GPIOC->PUPDR &= ~((3U << 12) | (3U << 14));
    GPIOC->PUPDR |=  ((1U << 12) | (1U << 14));

    // 2. MAP MUX FIRST: Route Pin 6 and Pin 7 to AF8 (USART6)
    GPIOC->AFR[0] &= ~((15U << 24) | (15U << 28));
    GPIOC->AFR[0] |=  ((8U  << 24) | (8U  << 28));

    // 3. ENGAGE PINS: Now switch to Alternate Function Mode safely
    GPIOC->MODER &= ~((3U << 12) | (3U << 14));
    GPIOC->MODER |=  ((2U << 12) | (2U << 14));

    // 4. SPEED: Configure High/Medium Speed
    GPIOC->OSPEEDR &= ~((3U << 12) | (3U << 14));
    GPIOC->OSPEEDR |=  ((1U << 12) | (1U << 14));
}


// Pass the hardware attributes and function pointer directly into the compile-time configuration instance
inline constexpr UartHardwareConfig Uart3Config {
	USART3, 			// .usart
	DMA1_Stream1, 		// .rxStream
	DMA1_Stream3, 		// .txStream
	4, 					// .dmaChannel
	DMA1, 				// .dmaBase
	USART3_IRQn, 		// .usartIrq
	DMA1_Stream3_IRQn,  // .txDmaIrq
	USART3_LowLevelInit // .lowLevelInit - hard-bound by construction
};

inline constexpr UartHardwareConfig Uart6Config {
	USART6, 			// .usart
	DMA2_Stream1, 		// .rxStream
	DMA2_Stream6, 		// .txStream
	5, 					// .dmaChannel
	DMA2, 				// .dmaBase
	USART6_IRQn, 		// .usartIrq
	DMA2_Stream6_IRQn,  // .txDmaIrq
	USART6_LowLevelInit // .lowLevelInit - hard-bound by construction
};


// ============================================================================
// DRIVER CORE IMPLEMENTATION
// ============================================================================

BareM_StatusTypeDef UartDriver::init(uint32_t baudrate) {
    // 1. Execute the hard-bound low-level clock/pin configuration
    if (config.lowLevelInit != nullptr) {
        config.lowLevelInit();
    }

