Nicolas7474/STM32_ESP32_OTA_UART_Dual-Bank_Bootloader/STM32/common/src/uart3.cpp
    // 2. CRUCIAL: Clear configuration flags first, but keep UE (Peripheral Enable) DISABLED for now
    config.usart->CR1 &= ~(USART_CR1_UE | USART_CR1_M | USART_CR1_RE | USART_CR1_TE);

    // 3. Dynamic Baud Rate Calculation using compile-time lookups
    uint32_t pclk_hz = APB1_CLOCK_FREQ;
    if (config.usart == USART1 || config.usart == USART6) {
    	pclk_hz = APB2_CLOCK_FREQ;
    }
    // Calculate and Set Baud Rate safely while the peripheral hardware engine is quiet
    uint32_t usartdiv = (pclk_hz + (baudrate / 2)) / baudrate;
    config.usart->BRR = usartdiv;

    // 4. Configure NVIC Interrupt Vectors
    NVIC_SetPriority(config.usartIrq, 4);
    NVIC_EnableIRQ(config.usartIrq);

    // 5. Explicitly initialize state links
    this->tx_link = LinkState::Idle;
    this->rx_link = LinkState::Idle;

    // 6. CLEAR GLITCHES: Force-clear any dirty status flags locked up during the step 1 pin-switch
    [[maybe_unused]] volatile uint32_t tmpreg = config.usart->SR;
    [[maybe_unused]] volatile uint32_t tmpdr  = config.usart->DR;

    // 7. FINALIZE: Enable the engine and the receiver/transmitter simultaneously
    config.usart->CR1 |= (USART_CR1_UE | USART_CR1_RE | USART_CR1_TE);

    return Bare_OK;
}

void UartDriver::ConfigureDma() {
	if (this->isDmaInitialized) return; // Exit immediately if already run once

	// Enable the clock before touching the register
	if (config.dmaBase == DMA1) {
		RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
	}
	else if (config.dmaBase == DMA2) {
		RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
	}

	// Configure DMA RX Stream (Circular buffer routing)
	config.rxStream->CR &= ~DMA_SxCR_EN;
	while (config.rxStream->CR & DMA_SxCR_EN);

	config.rxStream->CR |= (config.dmaChannel << DMA_SxCR_CHSEL_Pos)
                        | DMA_SxCR_PL_0   // Priority: Medium
                        | DMA_SxCR_MINC   // Memory Increment Mode enabled
                        | DMA_SxCR_CIRC   // Circular Mode enabled
                        | DMA_SxCR_TCIE;   // Interrupt at byte 1024
                        //| DMA_SxCR_HTIE;  // Interrupt at byte 512

    // Configure DMA TX Stream (Normal transmission mode)
    config.txStream->CR &= ~DMA_SxCR_EN;
    while (config.txStream->CR & DMA_SxCR_EN);

    config.txStream->CR |= (config.dmaChannel << DMA_SxCR_CHSEL_Pos)
                        | DMA_SxCR_PL_0   // Priority: Medium
                        | DMA_SxCR_MINC   // Memory Increment Mode enabled
                        | DMA_SxCR_DIR_0  // Direction: Memory-to-peripheral
                        | DMA_SxCR_TCIE;  // Transfer Complete Interrupt Enable

    NVIC_SetPriority(config.txDmaIrq, 5);
    NVIC_EnableIRQ(config.txDmaIrq);

    // Mark as initialized so this blocks never executes again
    this->isDmaInitialized = true;
}

UartDriver uart3(Uart3Config); // Global Instance allocation in the memory section (uart3 is extern)
UartDriver uart6(Uart6Config); // Global Instance allocation in the memory section (uart6 is extern)

// ============================================================================
// Functions DMA MODE
// ============================================================================

BareM_StatusTypeDef UartDriver::UART_Transmit_DMA(std::span<const uint8_t> message) {
	// std::span cleanly captures data layout pointers at zero runtime cost
	ConfigureDma();

	// Wait until the TX DMA stream is disabled and UART hardware shift register is empty (crucial)
	while ((config.txStream->CR & DMA_SxCR_EN) || !(config.usart->SR & USART_SR_TC));
	// Check ONLY if the TX wire is busy. RX can be doing whatever it wants!
	uint32_t timeout_counter = GetSysTick();
	while (this->tx_link != LinkState::Idle) {
		if (GetSysTick() - timeout_counter > 5) return Bare_TIMEOUT;
	}

	if (config.usart == USART3) {
		config.dmaBase->LIFCR = (0x3DUL << 22);
	}
	else if (config.usart == USART6) {
		config.dmaBase->HIFCR = (0x3DUL << 16);
	}
	config.usart->SR &= ~USART_SR_TC; // Clear UART transmission complete flag

	this->tx_link = LinkState::DMA; // Claim ONLY the TX highway
	uint16_t final_tx_length = 0;

#if defined(USE_COBS)
    // Calculate the maximum safe raw input allowed based on your BufferSize limits
    // For a BufferSize of 1024, max raw input is 1021 bytes to guarantee the encoded result fits.
    constexpr size_t maxRawInputSize = BufferSize - (BufferSize / 1021 + 1) - 1;
    size_t length_to_encode = std::min(message.size(), maxRawInputSize);

    // Encode directly from the span data into your permanent asynchronous class buffer
    cobs_encode_result encode_result = cobs_encode(
        txBuffer_DMA,
        BufferSize,
        message.data(),
        length_to_encode
    );

    if (encode_result.status != COBS_ENCODE_OK) {
    	this->tx_link = LinkState::Idle; // Reset state machine on error
        return Bare_ERROR;
    }
    // Append the mandatory framing delimiter zero marker at the end of the packet frame
    if (encode_result.out_len < BufferSize) {
        txBuffer_DMA[encode_result.out_len] = 0x00;
        final_tx_length = static_cast<uint16_t>(encode_result.out_len + 1);
    } else {
    	this->tx_link = LinkState::Idle;
        return Bare_ERROR; // Out of bounds safety check
    }

#else
    // Standard Transmission Layer (No COBS modification)
    size_t length = std::min(message.size(), BufferSize);
    // Because DMA transmissions happen asynchronously in the background while the CPU moves on,
    // you cannot point the DMA directly to message.data(). If you do, the DMA might transmit corrupted stack memory
    std::memcpy(txBuffer_DMA, message.data(), length); // Decouples the memory by copying the span into a dedicated, permanent internal class buffer
    final_tx_length = static_cast<uint16_t>(length);
#endif

    // The internal config structural elements replace the local pointers entirely
    config.txStream->PAR  = reinterpret_cast<uint32_t>(&config.usart->DR);
    config.txStream->M0AR = reinterpret_cast<uint32_t>(txBuffer_DMA);
    config.txStream->NDTR = final_tx_length;

    // Direct registry access with no runtime conditional dependencies
    if (config.usart == USART3) {
    	DMA1->LIFCR = (0x3DUL << 16);  // Clear DMA1 Stream 3 flags
    }
    else if (config.usart == USART6) {
    	DMA2->HIFCR = (0x3DUL << 16);   // Clear DMA2 Stream 6 flags (Lives in HISR!)
    }
    config.usart->CR3 	|= USART_CR3_DMAT;
    config.usart->CR1 	|= USART_CR1_TE;
    config.txStream->CR |= DMA_SxCR_EN;

    return Bare_OK;
}

BareM_StatusTypeDef UartDriver::startReceiveToIdle_DMA(std::span<uint8_t> user_buffer) {
	if (user_buffer.empty()) return Bare_ERROR;
	ConfigureDma();

    uint32_t timeout_counter = GetSysTick();
    config.rxStream->CR &= ~DMA_SxCR_EN; // Safely disable the RX DMA stream to reconfigure it

