Nicolas7474/STM32_ESP32_OTA_UART_Dual-Bank_Bootloader/STM32/common/src/uart3.cpp
    // Wait for hardware to fully flush and disable the stream (Max 5ms)
    while (config.rxStream->CR & DMA_SxCR_EN || !(config.usart->SR & USART_SR_TC)) {
        if (GetSysTick() - timeout_counter > 5) {
            return Bare_TIMEOUT;
        }
    }
    // Bind the runtime buffer destinations
    this->pRxUserBuffer_DMA = user_buffer.data();
    this->rxMaxLen_DMA = static_cast<uint16_t>(user_buffer.size());

    this->rx_link = LinkState::DMA;
    this->last_rx_read_index = 0;

    // Configure memory addresses and buffer lengths natively via span
    config.rxStream->PAR  = reinterpret_cast<uint32_t>(&config.usart->DR);
    config.rxStream->M0AR = reinterpret_cast<uint32_t>(this->pRxUserBuffer_DMA);
    config.rxStream->NDTR = rxMaxLen_DMA; // size of the user-provided buffer

    // Clear hardware flags for Stream 1 (CTCIF1, CHTIF1, CTEIF1, CDMEIF1, CFEIF1)
    config.dmaBase->LIFCR = (0x3DUL << 6); // // Works perfectly for DMA1 & DMA2 !
    config.usart->CR3 |= USART_CR3_DMAR; // DMA mode is enabled for reception
    config.usart->CR1 |= USART_CR1_RE | USART_CR1_IDLEIE; // Enable receiver and IDLE line interrupt

    // Fire up the RX engine
    config.rxStream->CR |= DMA_SxCR_EN;

    return Bare_OK;
}

//  Asynchronous Deferred Processor Executed inside ISR Context
void UartDriver::invalidateAndFlushRx() {
    if (rxCallback_DMA == nullptr) return;

    uint16_t current_dma_index = getRxBufferIndex(); // Snapshot the current hardware position (NDTR) first

    if (current_dma_index > last_rx_read_index) {
        // Direct linear data segment invocation
    	rxCallback_DMA(*this, std::span<const uint8_t>(&pRxUserBuffer_DMA[last_rx_read_index], current_dma_index - last_rx_read_index));
    }
    else if (current_dma_index < last_rx_read_index) {
        // Hardware buffer wrap-around handling
    	rxCallback_DMA(*this, std::span<const uint8_t>(&pRxUserBuffer_DMA[last_rx_read_index], rxMaxLen_DMA - last_rx_read_index));
        if (current_dma_index > 0) {
            rxCallback_DMA(*this, std::span<const uint8_t>(&pRxUserBuffer_DMA[0], current_dma_index));
        }
    }
    last_rx_read_index = current_dma_index; // Update the pointer strictly to the snapshot above
    // If they are equal, nothing happens, indices stay exactly where they are!
}


BareM_StatusTypeDef UartDriver::stopReceiveToIdle_DMA() {
    uint32_t timeout_counter = GetSysTick();

    config.usart->CR1 &= ~USART_CR1_IDLEIE; // 1. Disable the IDLE Line Interrupt first so it doesn't fire during shutdown
    config.rxStream->CR &= ~DMA_SxCR_EN; // 2. Disable the RX DMA Stream
    // 3. Wait for hardware to fully flush and acknowledge the disabled state (Max 5ms)
    while (config.rxStream->CR & DMA_SxCR_EN) {
        if (GetSysTick() - timeout_counter > 5) {
            return Bare_TIMEOUT; // Hardware stream is jammed
        }
    }
    config.usart->CR3 &= ~USART_CR3_DMAR;  // Disconnect the USART receiver from the DMA engine

    // Works perfectly for both! No if-conditions needed.
    config.dmaBase->LIFCR = (0x3DUL << 6);   // Clear DMA1 & DMA2 Stream 1 flags
    volatile uint32_t dummy_sr = config.usart->SR;  // Clear the UART internal IDLE flag line by reading SR then DR
    volatile uint32_t dummy_dr = config.usart->DR;
    (void)dummy_sr; (void)dummy_dr;

    this->rx_link = LinkState::Idle;
    return Bare_OK;
}

// ============================================================================
// Functions INTERRUPT MODE
// ============================================================================

BareM_StatusTypeDef UartDriver::UART_Transmit_IT(std::span<const uint8_t> message) {
	uint32_t timeout_counter = GetSysTick();
	// Check ONLY if the TX wire is busy. RX can be doing whatever it wants!
	while (this->tx_link != LinkState::Idle) {
		if (GetSysTick() - timeout_counter > 5) return Bare_TIMEOUT;
	}

	this->tx_link = LinkState::Interrupt; // Claim ONLY the TX highway
	this->tx_index_IT = 0;

	#if defined(USE_COBS)
	    // Cobs overheads, calculate the maximum safe raw input allowed based on your txInterruptBuffer capacity.
	    // For a buffer size of 1024, max raw input is 1021 bytes to guarantee the encoded result fits.
		constexpr size_t maxRawInputSize = BufferSize - (BufferSize / 1021 + 1) - 1; // BufferSize is fully known at compile time (this-> is not)
	    size_t length_to_encode = std::min(message.size(), maxRawInputSize);

	    // Encode directly from the span data into the persistent interrupt buffer
	    cobs_encode_result encode_result = cobs_encode(
	        txInterruptBuffer.data(),
	        txInterruptBuffer.size(),
	        message.data(),
	        length_to_encode
	    );

	    if (encode_result.status != COBS_ENCODE_OK) {
	    	this->tx_link = LinkState::Idle; // Reset state machine on failure
	        return Bare_ERROR;
	    }

	    // Append the mandatory framing delimiter zero marker at the end of the packet frame
	    if (encode_result.out_len < txInterruptBuffer.size()) {
	        txInterruptBuffer[encode_result.out_len] = 0x00;
	        this->tx_len_IT = static_cast<uint16_t>(encode_result.out_len + 1);
	    } else {
	    	this->tx_link = LinkState::Idle;
	        return Bare_ERROR; // Out of bounds safety check
	    }
	#else
	    // Standard Transmission Layer (No COBS modification)
	    size_t length = std::min(message.size(), txInterruptBuffer.size()); // Clip length safely to prevent buffer overflows
	    this->tx_len_IT = static_cast<uint16_t>(length);
	    // Modern C++ copy mechanism
	    std::copy_n(message.data(), length, txInterruptBuffer.begin());
	#endif

	config.usart->SR &= ~USART_SR_TC;  // TC flag is cleared before enabling interrupts. This step is important, as TC might still be set from a previous transmission.
	config.usart->CR1 |= USART_CR1_TXEIE; // TXE interrupt enable: An USART interrupt is generated whenever TXE=1 in the USART_SR register. It is cleared by a write to the USART_DR register.
	/* and TXE=1 when idle ! (do not enable TXE interrupt until you have smthg to send. Disable it BEFORE writing the last char to be sent)
	TXE: Transmit data register empty: This bit is set by hardware when the content of the TDR register has been transferred into the shift register. */
	return Bare_OK;
}

BareM_StatusTypeDef UartDriver::UART_Receive_IT(std::span<uint8_t> user_buffer, bool waitIfBusy) {
	if (user_buffer.empty()) return Bare_ERROR;

	uint32_t timeout_counter = GetSysTick();
	while (this->rx_link != LinkState::Idle) {
		if (waitIfBusy) {
			if (GetSysTick() - timeout_counter > 10) {
				return Bare_TIMEOUT; // Unjams the CPU and reports the issue!
			}
		} else {
			return Bare_BUSY; // Act like the ST HAL: Return immediately if busy
		}
	}
	// Bind the runtime buffer destinations
	this->pRxUserBuffer_IT = user_buffer.data();
    this->rxMaxLen_IT = static_cast<uint16_t>(user_buffer.size());

    this->rx_link = LinkState::Interrupt; // Claim ONLY the RX highway

