Nicolas7474/STM32_ESP32_OTA_UART_Dual-Bank_Bootloader/STM32/common/src/uart3.cpp
    // Unmask the hardware interrupts to allow reception now
    config.usart->CR1 |= (USART_CR1_RXNEIE | USART_CR1_IDLEIE);

    return Bare_OK;
}

// ============================================================================
// INTERRUPT SERVICE ROUTINE
// ============================================================================

extern "C" {

void DMA1_Stream1_IRQHandler(void) {		// Rx IRQHandler
    if (DMA1->LISR & DMA_LISR_TCIF1) {
    	DMA1->LIFCR = DMA_LIFCR_CTCIF1; 	// Clear Transfer Complete flag
    	uart3.invalidateAndFlushRx();
    }
    if (DMA1->LISR & DMA_LISR_HTIF1) {
    	DMA1->LIFCR = DMA_LIFCR_CHTIF1;
    	uart3.invalidateAndFlushRx();
    }
}

void DMA1_Stream3_IRQHandler(void) {		// Tx IRQHandler
	if (DMA1->LISR & DMA_LISR_TCIF3) {
		DMA1->LIFCR = DMA_LIFCR_CTCIF3; 	// Clear TX Transfer Complete
	/*	Because LinkState is defined inside the private/protected scope of the UartDriver class, global functions
		cannot see it as a standalone type. They must access it using class scope resolution: UartDriver::LinkState::Idle. */
		uart3.tx_link = UartDriver::LinkState::Idle; // Release TX link status
	}
}

void DMA2_Stream1_IRQHandler(void) {        // Uart6 Rx DMA Handler
	if (DMA2->LISR & DMA_LISR_TCIF1) {
		DMA2->LIFCR = DMA_LIFCR_CTCIF1;     // Clear flags on DMA2 Base!
		uart6.invalidateAndFlushRx();
	}
	if (DMA2->LISR & DMA_LISR_HTIF1) {
		DMA2->LIFCR = DMA_LIFCR_CHTIF1;
		uart6.invalidateAndFlushRx();
	}
}

void DMA2_Stream6_IRQHandler(void) {        // Uart6 Tx DMA Handler
	if (DMA2->HISR & DMA_HISR_TCIF6) {       // Note: Stream 6 flags live in HISR!
		DMA2->HIFCR = DMA_HIFCR_CTCIF6;
		uart6.tx_link = UartDriver::LinkState::Idle;
	}
}

void USART3_IRQHandler() {

	// HANDLE RX EVENTS
	if (uart3.rx_link == UartDriver::LinkState::Interrupt) {
		// receive UART bytes
		if (uart3.config.usart->SR & USART_SR_RXNE) { // 'Receive register not empty' interrupt; RXNE is cleared by a read to the USART_DR register
			uart3.rx_link = UartDriver::LinkState::Interrupt;
			uart3.pRxUserBuffer_IT[uart3.count_rx_IT] = uart3.config.usart->DR;    // Copy new data into the buffer
			uart3.count_rx_IT = uart3.count_rx_IT + 1;
			if (uart3.count_rx_IT >= uart3.rxMaxLen_IT) uart3.count_rx_IT = 0;  // Prevent overflowing the 1024-byte bufferRx array
		}
		// detect idle line, indicates the last character is received
		else if(uart3.config.usart->SR & USART_SR_IDLE) {
			volatile uint32_t dummy = uart3.config.usart->SR;
			dummy = uart3.config.usart->DR; (void)dummy; 	// Clear IDLE flag (Read SR then DR)
			// Turn off interrupts to close the reception window (Matches HAL style)
			uart3.config.usart->CR1 &= ~(USART_CR1_RXNEIE | USART_CR1_IDLEIE);
			uart3.rx_link = UartDriver::LinkState::Idle; // Clear RX link state separately!
			// Execute callback if there is data collected and the pointer is valid
			if (uart3.count_rx_IT > 0 && uart3.rxCallback_IT != nullptr) {
				// Pass exactly the slice of bytes that arrived
				uart3.rxCallback_IT(uart3, std::span<const uint8_t>(uart3.pRxUserBuffer_IT, uart3.count_rx_IT));
			}
			uart3.count_rx_IT = 0;
		}
	}
	else if (uart3.rx_link == UartDriver::LinkState::DMA) {
		if (uart3.config.usart->SR & USART_SR_IDLE) {
			// Safely clear IDLE flag and flush data
			volatile uint32_t dummy = uart3.config.usart->SR | uart3.config.usart->DR; (void)dummy;
			uart3.invalidateAndFlushRx();
			// Keep rx_link as LinkState::DMA because circular background listening continues!
		}
	}

	// 2. HANDLE TX EVENTS
	if (uart3.tx_link == UartDriver::LinkState::Interrupt) {
		// send UART bytes
		if ((uart3.config.usart->CR1 & USART_CR1_TXEIE) && (uart3.config.usart->SR & USART_SR_TXE)) {
			if (uart3.tx_index_IT < uart3.tx_len_IT) {
				uart3.tx_link = UartDriver::LinkState::Interrupt;
				uart3.config.usart->DR = uart3.txInterruptBuffer[uart3.tx_index_IT]; // Read and assign, then modify and write back safely
				uart3.tx_index_IT = uart3.tx_index_IT + 1;  // Avoid the warning: '++' expression of 'volatile'-qualified type is deprecated
			}
			if (uart3.tx_index_IT == uart3.tx_len_IT)	{
				uart3.config.usart->CR1 |= USART_CR1_TCIE; // TCIE: Transmission complete interrupt enable
				uart3.config.usart->CR1 &= ~USART_CR1_TXEIE;
				// No need to memset/clear the buffer here: tx_len_IT and tx_index_IT guard the index access,
				// leaving old data in memory has zero performance impact or side effects.
			}
		}
		// This bit is set by hw if the transmit of a frame is complete and if TXE is set.
		else if ((uart3.config.usart->SR & USART_SR_TC) && (uart3.config.usart->CR1 & USART_CR1_TCIE)) {
			uart3.config.usart->SR &= ~USART_SR_TC; // clear USART_SR_TC;
			uart3.config.usart->CR1 &= ~USART_CR1_TCIE;
			uart3.tx_link = UartDriver::LinkState::Idle;
		}
	}

	// Aggressive error clearing
	if (uart3.config.usart->SR & (USART_SR_ORE | USART_SR_NE | USART_SR_FE | USART_SR_PE)) {
		volatile uint32_t dummy_sr = uart3.config.usart->SR;
		volatile uint32_t dummy_dr = uart3.config.usart->DR;
		(void)dummy_sr;
		(void)dummy_dr; // Reading SR followed by DR clears all core errors
	}
}


void USART6_IRQHandler() {

	// HANDLE RX EVENTS
	if (uart6.rx_link == UartDriver::LinkState::Interrupt) {
		// receive UART bytes
		if (uart6.config.usart->SR & USART_SR_RXNE) { // 'Receive register not empty' interrupt; RXNE is cleared by a read to the USART_DR register
			uart6.rx_link = UartDriver::LinkState::Interrupt;
			uart6.pRxUserBuffer_IT[uart6.count_rx_IT] = uart6.config.usart->DR;    // Copy new data into the buffer
			uart6.count_rx_IT = uart6.count_rx_IT + 1;
			if (uart6.count_rx_IT >= uart6.rxMaxLen_IT) uart6.count_rx_IT = 0;  // Prevent overflowing the 1024-byte bufferRx array
		}
		// detect idle line, indicates the last character is received
		else if(uart6.config.usart->SR & USART_SR_IDLE) {
			volatile uint32_t dummy = uart6.config.usart->SR;
			dummy = uart6.config.usart->DR; (void)dummy; 	// Clear IDLE flag (Read SR then DR)
			// Turn off interrupts to close the reception window (Matches HAL style)
			uart6.config.usart->CR1 &= ~(USART_CR1_RXNEIE | USART_CR1_IDLEIE);
			uart6.rx_link = UartDriver::LinkState::Idle; // Clear RX link state separately!
			// Execute callback if there is data collected and the pointer is valid
			if (uart6.count_rx_IT > 0 && uart6.rxCallback_IT != nullptr) {
				// Pass exactly the slice of bytes that arrived
				uart6.rxCallback_IT(uart6, std::span<const uint8_t>(uart6.pRxUserBuffer_IT, uart6.count_rx_IT));
			}
			uart6.count_rx_IT = 0;
		}
	}
	else if (uart6.rx_link == UartDriver::LinkState::DMA) {
		if (uart6.config.usart->SR & USART_SR_IDLE) {
			// Safely clear IDLE flag and flush data
			volatile uint32_t dummy = uart6.config.usart->SR | uart6.config.usart->DR; (void)dummy;
			uart6.invalidateAndFlushRx();
			// Keep rx_link as LinkState::DMA because circular background listening continues!
		}
	}

