Nicolas7474/STM32_ESP32_OTA_UART_Dual-Bank_Bootloader/STM32/common/src/uart3.cpp
	// 2. HANDLE TX EVENTS
	if (uart6.tx_link == UartDriver::LinkState::Interrupt) {
		// send UART bytes
		if ((uart6.config.usart->CR1 & USART_CR1_TXEIE) && (uart6.config.usart->SR & USART_SR_TXE)) {
			if (uart6.tx_index_IT < uart6.tx_len_IT) {
				uart6.tx_link = UartDriver::LinkState::Interrupt;
				uart6.config.usart->DR = uart6.txInterruptBuffer[uart6.tx_index_IT]; // Read and assign, then modify and write back safely
				uart6.tx_index_IT = uart6.tx_index_IT + 1;  // Avoid the warning: '++' expression of 'volatile'-qualified type is deprecated
			}
			if (uart6.tx_index_IT == uart6.tx_len_IT)	{
				uart6.config.usart->CR1 |= USART_CR1_TCIE; // TCIE: Transmission complete interrupt enable
				uart6.config.usart->CR1 &= ~USART_CR1_TXEIE;
				// No need to memset/clear the buffer here: tx_len_IT and tx_index_IT guard the index access,
				// leaving old data in memory has zero performance impact or side effects.
			}
		}
		// This bit is set by hw if the transmit of a frame is complete and if TXE is set.
		else if ((uart6.config.usart->SR & USART_SR_TC) && (uart6.config.usart->CR1 & USART_CR1_TCIE)) {
			uart6.config.usart->SR &= ~USART_SR_TC; // clear USART_SR_TC;
			uart6.config.usart->CR1 &= ~USART_CR1_TCIE;
			uart6.tx_link = UartDriver::LinkState::Idle;
		}
	}

	// Aggressive error clearing
	if (uart6.config.usart->SR & (USART_SR_ORE | USART_SR_NE | USART_SR_FE | USART_SR_PE)) {
		volatile uint32_t dummy_sr = uart6.config.usart->SR;
		volatile uint32_t dummy_dr = uart6.config.usart->DR;
		(void)dummy_sr;
		(void)dummy_dr; // Reading SR followed by DR clears all core errors
	}
}

} // extern "C"


// ============================================================================
// Functions POLLING MODE
// ============================================================================

BareM_StatusTypeDef UartDriver::UART_Transmit(std::span<const uint8_t> message, uint32_t timeout_ms) {
    if (message.empty()) return Bare_OK;

    // 1. Synchronize: Wait for any asynchronous TX operations (DMA/IT) to complete
    uint32_t start_tick = GetSysTick();
    while (this->tx_link != UartDriver::LinkState::Idle) {
        if (GetSysTick() - start_tick > timeout_ms) return Bare_TIMEOUT;
    }

    // 2. Claim the TX highway for Polling
    this->tx_link = UartDriver::LinkState::Polling;

    // 3. Clear the hardware Transmission Complete flag before beginning
    config.usart->SR &= ~USART_SR_TC;

    // 4. Loop through each character in the span
    for (uint8_t b : message) {
        // Wait for Transmit Data Register to be Empty (TXE)
        while (!(config.usart->SR & USART_SR_TXE)) {
            if (GetSysTick() - start_tick > timeout_ms) {
                this->tx_link = UartDriver::LinkState::Idle; // Release line on error
                return Bare_TIMEOUT;
            }
        }
        // Write byte directly to the Data Register
        config.usart->DR = b;
    }

    // 5. Wait for the final character to shift completely off the wire (TC)
    while (!(config.usart->SR & USART_SR_TC)) {
        if (GetSysTick() - start_tick > timeout_ms) {
            this->tx_link = UartDriver::LinkState::Idle;
            return Bare_TIMEOUT;
        }
    }

    // 6. Release the highway
    this->tx_link = UartDriver::LinkState::Idle;
    return Bare_OK;
}

BareM_StatusTypeDef UartDriver::UART_Receive(std::span<uint8_t> user_buffer, uint32_t timeout_ms) {
    if (user_buffer.empty()) return Bare_ERROR;

    // 1. Synchronize: Wait for any active asynchronous RX operations to yield
    uint32_t start_tick = GetSysTick();
    while (this->rx_link != UartDriver::LinkState::Idle) {
        if (GetSysTick() - start_tick > timeout_ms) return Bare_TIMEOUT;
    }

    // 2. Claim the RX highway for Polling
    this->rx_link = UartDriver::LinkState::Polling;

    // 3. Step through user buffer and fill it byte-by-byte
    for (size_t i = 0; i < user_buffer.size(); ++i) {
        // Wait for Read Data Register Not Empty (RXNE) flag
        while (!(config.usart->SR & USART_SR_RXNE)) {

            // Check for hardware overrun/noise/framing errors while waiting and clear them
            if (config.usart->SR & (USART_SR_ORE | USART_SR_NE | USART_SR_FE | USART_SR_PE)) {
                volatile uint32_t dummy_sr = config.usart->SR;
                volatile uint32_t dummy_dr = config.usart->DR;
                (void)dummy_sr; (void)dummy_dr;
            }

            if (GetSysTick() - start_tick > timeout_ms) {
                this->rx_link = UartDriver::LinkState::Idle; // Release line on error
                return Bare_TIMEOUT;
            }
        }

        // Read byte directly from Data Register (clears RXNE automatically)
        user_buffer[i] = static_cast<uint8_t>(config.usart->DR);
    }

    // 4. Release the highway
    this->rx_link = UartDriver::LinkState::Idle;
    return Bare_OK;
}
